04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/CHT/circuitBoardCooling/0/fluid/nut.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentViscosity];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(floor|ceiling|fluid_to_baffle3D_.*)"
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    "(inlet|outlet)"
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
